app/Controllers/AuthController.php

INSERT INTO `users` (`username`, `email`, `password`, `created_at`) VALUES ('sinta', 'sinta@gmail.com', '$2y$10$ArBYgp5llDVRpXEfL6R3kOQvpNNT9RNyfzVvoOe9zaxsCnRXZ7wL6', '2024-12-04 10:34:35')
---
    public function storeRegister()
    {
        // Membuat instance UserModel untuk berinteraksi dengan database
        $userModel = new UserModel();

        // Ambil data dari form yang dikirimkan via POST
        $data = [
            'username'   => $this->request->getPost('username'),
            'email'      => $this->request->getPost('email'),
            'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'created_at' => date('Y-m-d H:i:s'), // Tetapkan created_at secara manual
        ];

        // Simpan data ke database
        $userModel->save($data);

SELECT *
FROM `users`
WHERE `email` = 'sinta@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        // Membuat instance UserModel untuk berinteraksi dengan database
        $userModel = new UserModel();

        // Ambil data email dan password dari form yang dikirimkan via POST
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Mencari user berdasarkan email
        $user = $userModel->where('email', $email)->first();