app/Controllers/DashboardController.php

    public function index()
    {
        $produkModel = new ProdukModel();
        $kategoriModel = new KategoriModel();
        $pemasokModel = new PemasokModel();

        $data = [
            'totalProduk' => $produkModel->countAllResults(),
            'totalKategori' => $kategoriModel->countAllResults(),
            'totalPemasok' => $pemasokModel->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `pemasok`