app/Controllers/KategoriController.php

    public function index()
    {
        $data['kategori'] = $this->kategoriModel->findAll();
---
SELECT *
FROM `kategori`