app/Controllers/PembelianController.php

    public function edit($id)
    {
        $model = new PembelianModel();
        $data['pembelian'] = $model->find($id);

        // Ambil data pemasok dan produk untuk dropdown
        $modelPemasok = new \App\Models\PemasokModel();
        $modelProduk = new \App\Models\ProdukModel();

        // Ambil data detail pembelian
        $modelDetail = new \App\Models\DetailPembelianModel();
        $data['detailPembelian'] = $modelDetail->where('id_pembelian', $id)->findAll();

        $data['pemasok'] = $modelPemasok->findAll();
        $data['produk'] = $modelProduk->findAll();
---
SELECT *
FROM `pembelian`
WHERE `pembelian`.`id_pembelian` = '2'
SELECT *
FROM `detail_pembelian`
WHERE `id_pembelian` = '2'
SELECT *
FROM `pemasok`
SELECT *
FROM `produk`