app/Controllers/PenjualanController.php

    public function create()
    {
        $data = [
            'produk' => $this->produkModel->findAll(),
            'pelanggan' => $this->pelangganModel->findAll()
        ];
---
SELECT *
FROM `produk`
SELECT *
FROM `pelanggan`

    public function edit($id_penjualan)
{
    $penjualanModel = new PenjualanModel();
    $penjualan = $penjualanModel->find($id_penjualan);

    // Ambil data pelanggan untuk dropdown
    $pelangganModel = new PelangganModel();
    $pelanggan = $pelangganModel->findAll();

    // Ambil data produk untuk dropdown
    $produkModel = new ProdukModel();
    $produk = $produkModel->findAll();
---
SELECT *
FROM `penjualan`
WHERE `penjualan`.`id_penjualan` = '4'
SELECT *
FROM `pelanggan`
SELECT *
FROM `produk`

    public function update($id)
    {
        $penjualan = $this->penjualanModel->find($id);
        if (!$penjualan) {
            return redirect()->to('/penjualan')->with('error', 'Data penjualan tidak ditemukan.');
        }

        $id_pelanggan = $this->request->getPost('id_pelanggan');
        $produk = $this->request->getPost('produk');

        if (!$id_pelanggan || empty($produk)) {
            return redirect()->back()->with('error', 'Data pelanggan atau produk tidak boleh kosong.');
        }

        $total_harga = 0;
        foreach ($produk as $item) {
            if (isset($item['jumlah'], $item['harga_satuan'])) {
                $total_harga += $item['jumlah'] * $item['harga_satuan'];
            }
        }

        $dataPenjualan = [
            'id_pelanggan' => $id_pelanggan,
            'total_harga' => $total_harga,
            'tanggal_penjualan' => date('Y-m-d H:i:s')
        ];
        $this->penjualanModel->update($id, $dataPenjualan);

        // Hapus detail lama dan tambahkan yang baru
        $this->detailPenjualanModel->where('id_penjualan', $id)->delete();
---
SELECT *
FROM `detail_penjualan`
WHERE `id_penjualan` = '5'
DELETE FROM `detail_penjualan`
WHERE `id_penjualan` = '4'
SELECT *
FROM `penjualan`
WHERE `penjualan`.`id_penjualan` = '5'
DELETE FROM `penjualan`
WHERE `id_penjualan` IN ('4')