app/Controllers/ProdukController.php

SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
---
    public function index()
    {
        // Ambil data produk dengan nama kategori
        $produk = $this->produkModel->select('produk.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
            ->findAll();

SELECT *
FROM `kategori`
---
    public function create()
    {
        // Ambil semua kategori untuk dropdown
        $data['kategori'] = $this->kategoriModel->findAll();