app/Models/PembelianModel.php

SELECT `pembelian`.*, `pemasok`.`nama_pemasok`
FROM `pembelian`
JOIN `pemasok` ON `pembelian`.`id_pemasok` = `pemasok`.`id_pemasok`
---
    public function getPembelian()
    {
        // Join dengan tabel pemasok untuk mendapatkan nama pemasok
        return $this->select('pembelian.*, pemasok.nama_pemasok')
            ->join('pemasok', 'pembelian.id_pemasok = pemasok.id_pemasok')
            ->findAll();