app/Models/PenjualanModel.php

    public function getPenjualanWithPelanggan()
    {
        return $this->select('penjualan.*, pelanggan.nama_pelanggan')
            ->join('pelanggan', 'pelanggan.id_pelanggan = penjualan.id_pelanggan')
            ->findAll();
---
SELECT `penjualan`.*, `pelanggan`.`nama_pelanggan`
FROM `penjualan`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `penjualan`.`id_pelanggan`